a316363723/pr307-308/pr_307_308_2025_controlbox/HC32F4A0x_standard_peripheral/Include/hc32f4a0_usb_core_driver.h
/**
 *******************************************************************************
 * @file  hc32f4a0_usb_core_driver.h
 * @brief Header of the Core Layer Driver
 @verbatim
   Change Logs:
   Date             Author          Notes
   2021-03-29       Linsq           First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __USB_CORE_DRIVER_H__
#define __USB_CORE_DRIVER_H__

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "usb_app_conf.h"
#include "hc32f4a0_usb_core_regs.h"
#include "hc32f4a0_usb_defines.h"


#if   defined ( __CC_ARM )
  #define __ASM            __asm                                      
  #define __INLINE         __inline                                  

#elif defined ( __GNUC__ )
  #define __ASM            __asm                                    
  #define __INLINE         inline                                   

#elif defined ( __ICCARM__ )
  #define __ASM            __asm                                      
  #define __INLINE         inline                                    
#endif

#ifdef USB_INTERNAL_DMA_ENABLED
    #if defined   (__GNUC__)        /* GNU Compiler */
        #define __USB_ALIGN_END    __attribute__ ((aligned (4)))
        #define __USB_ALIGN_BEGIN
    #else
        #define __USB_ALIGN_END
        #if defined   (__CC_ARM)      /* ARM Compiler */
            #define __USB_ALIGN_BEGIN    __align(4)
        #elif defined (__ICCARM__)    /* IAR Compiler */
            #define __USB_ALIGN_BEGIN
        #elif defined  (__TASKING__)  /* TASKING Compiler */
            #define __USB_ALIGN_BEGIN    __align(4)
        #endif /* __CC_ARM */
    #endif /* __GNUC__ */
#else
    #define __USB_ALIGN_BEGIN
    #define __USB_ALIGN_END
#endif

/*******************************************************************************
 * GLOBAL #define
 ******************************************************************************/
#define USB_EP0_IDLE                        (0u)
#define USB_EP0_SETUP                       (1u)
#define USB_EP0_DATA_IN                     (2u)
#define USB_EP0_DATA_OUT                    (3u)
#define USB_EP0_STATUS_IN                   (4u)
#define USB_EP0_STATUS_OUT                  (5u)
#define USB_EP0_STALL                       (6u)

#define USB_EP_TX_DIS                       (0x0000u)
#define USB_EP_TX_STALL                     (0x0010u)
#define USB_EP_TX_NAK                       (0x0020u)
#define USB_EP_TX_VALID                     (0x0030u)

#define USB_EP_RX_DIS                       (0x0000u)
#define USB_EP_RX_STALL                     (0x1000u)
#define USB_EP_RX_NAK                       (0x2000u)
#define USB_EP_RX_VALID                     (0x3000u)

#define MAX_DATA_LENGTH                     (0x200u)

/*******************************************************************************
 *       typedef
 ******************************************************************************/

#define HD_USB_OK      0u
#define HD_USB_ERROR   1u

//status of the host channel
typedef enum {
    HOST_CH_IDLE = 0u,
    HOST_CH_XFERCOMPL,
    HOST_CH_CHHLTD,
    HOST_CH_NAK,
    HOST_CH_NYET,
    HOST_CH_STALL,
    HOST_CH_XACTERR,
    HOST_CH_BBLERR,
    HOST_CH_DATATGLERR,
    HOST_CH_AHBERR,
    HOST_CH_FRMOVRUN,
    HOST_CH_BNAINTR,
    HOST_CH_XCS_XACT_ERR,
    HOST_CH_DESC_LST_ROLLINTR
}HOST_CH_STATUS;

typedef enum {
    HOST_CH_XFER_IDLE = 0u,
    HOST_CH_XFER_DONE,
    HOST_CH_XFER_UNREADY,
    HOST_CH_XFER_ERROR,
    HOST_CH_XFER_STALL
}HOST_CH_XFER_STATE;

typedef enum {
    CTRL_START = 0u,
    CTRL_XFRC,
    CTRL_HALTED,
    CTRL_NAK,
    CTRL_STALL,
    CTRL_XACTERR,
    CTRL_BBLERR,
    CTRL_DATATGLERR,
    CTRL_FAIL
}CTRL_HANDLE_STATUS;

typedef struct
{
    uint8_t       dev_addr;  
    uint8_t       ep_idx;    
    uint8_t       is_epin;   
    uint8_t       ch_speed;  
    uint8_t       do_ping;
    uint8_t       ep_type;   
    uint16_t      max_packet;
    uint8_t       pid_type;   
    uint8_t       in_toggle;
    uint8_t       out_toggle;    
    /* transaction level variables*/
    uint32_t      dma_addr;
    uint32_t      xfer_len;
    uint32_t      xfer_count;    
    uint8_t       *xfer_buff;
}USB_HOST_CH;

typedef struct
{
    uint8_t        epidx;
    uint8_t        ep_dir;  
    uint8_t        trans_type;
    uint8_t        ep_stall;
    uint8_t        data_pid_start;
    uint8_t        datax_pid;
    uint16_t       tx_fifo_num;
    uint32_t       maxpacket;
    /* Transfer level variables */
    uint32_t       rem_data_len;
    uint32_t       total_data_len;
    uint32_t       ctl_data_len;
    /* transaction level variables*/
    uint32_t       dma_addr;
    uint32_t       xfer_len;
    uint32_t       xfer_count;
    uint8_t        *xfer_buff;    
}USB_DEV_EP;

typedef struct
{
    uint8_t       host_chnum;
    uint8_t       dev_epnum;
    uint8_t       dmaen;
    uint8_t       low_power; 
    uint8_t       phy_type;
    uint8_t       core_type;
} USB_CORE_BASIC_CFGS;

typedef struct
{
    uint8_t   bmRequest;
    uint8_t   bRequest;
    uint16_t  wValue;
    uint16_t  wIndex;
    uint16_t  wLength;
} USB_SETUP_REQ;

typedef struct
{
    uint8_t  *(*get_dev_desc)(uint16_t *length);
    uint8_t  *(*get_dev_langiddesc)(uint16_t *length);
    uint8_t  *(*get_dev_manufacturerstr)(uint16_t *length);
    uint8_t  *(*get_dev_productstr)(uint16_t *length);
    uint8_t  *(*get_dev_serialstr)(uint16_t *length);
    uint8_t  *(*get_dev_configstr)(uint16_t *length);
    uint8_t  *(*get_dev_interfacestr)(uint16_t *length);
} usb_dev_desc_func;

typedef struct
{
    void     (*class_init)                (void *pdev);
    void     (*class_deinit)              (void *pdev);
    uint8_t  (*ep0_setup)                 (void *pdev, USB_SETUP_REQ *req);
    void     (*ep0_datain)                (void *pdev);
    void     (*ep0_dataout)               (void *pdev);
    uint8_t  *(*class_getconfigdesc)      (uint16_t *length);
    uint8_t  (*class_sof)                 (void *pdev);
    void     (*class_datain)              (void *pdev, uint8_t epnum);
    void     (*class_dataout)             (void *pdev, uint8_t epnum);   
    void     (*class_syn_in_incomplt)     (void *pdev);
    void     (*class_syn_out_incomplt)    (void *pdev);      
} usb_dev_class_func;

typedef struct
{
    void (*user_init)(void);
    void (*user_devrst)(void);
    void (*user_devconfig)(void);
    void (*user_devsusp)(void);
    void (*user_devresume)(void);
    void (*user_devconn)(void);
    void (*user_devdisconn)(void);
}usb_dev_user_func;

typedef struct
{
    __IO uint8_t           device_config;
    __IO uint8_t           device_address;
    __IO uint8_t           device_state;
    __IO uint8_t           device_old_status;
    __IO uint8_t           device_cur_status;
    __IO uint8_t           connection_status;
    __IO uint8_t           device_remote_wakeup;
    __IO uint8_t           test_mode; 
    USB_DEV_EP             in_ep[USB_MAX_TX_FIFOS];
    USB_DEV_EP             out_ep[USB_MAX_TX_FIFOS];
    uint8_t                setup_pkt_buf[24];
    usb_dev_class_func     *class_callback;
    usb_dev_user_func      *user_callback;
    usb_dev_desc_func      *desc_callback;
}USB_DEV_PARAM;

typedef struct
{
    uint16_t                 channel[USB_MAX_TX_FIFOS];
    USB_HOST_CH              hc[USB_MAX_TX_FIFOS];
    __IO uint32_t            is_dev_connect;
    uint8_t                  Rx_Buffer[MAX_DATA_LENGTH];           
    __IO uint32_t            ErrCnt[USB_MAX_TX_FIFOS];
    __IO uint32_t            XferCnt[USB_MAX_TX_FIFOS];
    __IO HOST_CH_STATUS      HC_Status[USB_MAX_TX_FIFOS];
    __IO HOST_CH_XFER_STATE  URB_State[USB_MAX_TX_FIFOS];
}USB_HOST_PARAM;

typedef struct
{
    USB_CORE_BASIC_CFGS    basic_cfgs;
    HD_USB_REGS            regs;
#ifdef USE_DEVICE_MODE
    USB_DEV_PARAM          dev;
#endif
#ifdef USE_HOST_MODE
    USB_HOST_PARAM         host;
#endif
}usb_core_instance;

