a316363723/pr307-308/pr_307_308_2025_controlbox/HC32F4A0x_standard_peripheral/Include/hc32f4a0_usb_core_driver.h
/*******************************************************************************
 *            inline functions
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief  get the current mode of the usb core from the corresponding register
 ** \param  pdev : device instance
 ** \retval current mode \@=1: host mode \@=0: device mode
 ******************************************************************************/
static __INLINE uint8_t hd_usb_getcurmod(usb_core_instance *pdev)
{
    uint8_t tmp;
    USB_CORE_GINTSTS_TypeDef tmp_gintsts;
    tmp_gintsts.d32 = HD_USB_RDREG32(&pdev->regs.GREGS->GINTSTS);
    tmp             = tmp_gintsts.b.curmode;
    return tmp;
}

/**
 *******************************************************************************
 ** \brief  Initializes the normal interrupts       
 ** \param  pdev: device instance
 ** \retval none
 ******************************************************************************/
static __INLINE void hd_usb_normalinten(usb_core_instance *pdev)
{
    USB_CORE_GINTMSK_TypeDef  tmp_gintmsk;
    tmp_gintmsk.d32          = 0ul;
    HD_USB_WRREG32(&pdev->regs.GREGS->GOTGINT, 0xFFFFFFFFul);
    HD_USB_WRREG32(&pdev->regs.GREGS->GINTSTS, 0xBFFFFFFFul);
    tmp_gintmsk.b.wkupintr   = 1u;
    tmp_gintmsk.b.usbsuspend = 1u;
    HD_USB_WRREG32(&pdev->regs.GREGS->GINTMSK, tmp_gintmsk.d32);
}

/**
 *******************************************************************************
 ** \brief  clear all the pending device interrupt bits and mask the IN and OUT 
 **         endpoint interrupts.
 ** \param  pdev: device instance
 ** \retval none
 ******************************************************************************/
static __INLINE void hd_usb_clrandmskepint(usb_core_instance *pdev)
{
    HD_USB_WRREG32(&pdev->regs.DREGS->DIEPMSK, 0ul );
    HD_USB_WRREG32(&pdev->regs.DREGS->DOEPMSK, 0ul );
    HD_USB_WRREG32(&pdev->regs.DREGS->DAINT, 0xFFFFFFFFul );
    HD_USB_WRREG32(&pdev->regs.DREGS->DAINTMSK, 0ul );
}

/**
 *******************************************************************************
 ** \brief  generate a device connect signal to the USB host 
 ** \param  pdev: device instance
 ** \retval none
 ******************************************************************************/
static __INLINE void hd_usb_coreconn(usb_core_instance *pdev)
{
    USB_CORE_DCTL_TypeDef tmp_dctl;
    tmp_dctl.d32         = HD_USB_RDREG32(&pdev->regs.DREGS->DCTL);
    tmp_dctl.b.sftdiscon = 0u;
    HD_USB_WRREG32(&pdev->regs.DREGS->DCTL, tmp_dctl.d32);    
}

/**
 *******************************************************************************
 ** \brief  test of mode processing
 **         
 ** \param  pdev: device instance
 ** \retval none
 ******************************************************************************/
static __INLINE void hd_usb_runtestmode(usb_core_instance *pdev, uint32_t reg)
{
    HD_USB_WRREG32(&pdev->regs.DREGS->DCTL, reg);
}

/**
 *******************************************************************************
 ** \brief  Enables the controller's Global interrupts in the AHB Configuration
 **         registers.
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
static __INLINE void hd_usb_ginten(usb_core_instance *pdev)
{
    USB_CORE_GAHBCFG_TypeDef  tmp_gahbcfg;

    tmp_gahbcfg.d32           = 0ul;
    tmp_gahbcfg.b.glblintrmsk = 1u;
    HD_USB_MDFREG32(&pdev->regs.GREGS->GAHBCFG, 0ul, tmp_gahbcfg.d32);
}

/**
 *******************************************************************************
 ** \brief  Disable the controller's Global interrupt in the AHB Configuration
 **         register.
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
static __INLINE void hd_usb_gintdis(usb_core_instance *pdev)
{
    USB_CORE_GAHBCFG_TypeDef  tmp_gahbcfg;
    tmp_gahbcfg.d32           = 0ul;
    tmp_gahbcfg.b.glblintrmsk = 1u;
    HD_USB_MDFREG32(&pdev->regs.GREGS->GAHBCFG, tmp_gahbcfg.d32, 0ul);
}

/**
 *******************************************************************************
 ** \brief  Get the Core Interrupt bits from the interrupt register not including 
 **         the bits that are masked.
 ** \param  pdev : device instance
 ** \retval status[32bits]
 ******************************************************************************/
static __INLINE uint32_t hd_usb_getcoreintr(usb_core_instance *pdev)
{
    uint32_t v = 0ul;
    v  = HD_USB_RDREG32(&pdev->regs.GREGS->GINTSTS);
    v &= HD_USB_RDREG32(&pdev->regs.GREGS->GINTMSK);
    return v;
}

/**
 *******************************************************************************
 ** \brief  Get the out endpoint interrupt bits from the all endpoint interrupt 
 **         register not including the bits masked.
 ** \param  pdev : device instance
 ** \retval The status that shows which OUT EP have interrupted.
 ******************************************************************************/
static __INLINE uint32_t hd_usb_getalloepintr(usb_core_instance *pdev)
{
    uint32_t v;
    v  = HD_USB_RDREG32(&pdev->regs.DREGS->DAINT);
    v &= HD_USB_RDREG32(&pdev->regs.DREGS->DAINTMSK);
    return ((v & 0xffff0000ul) >> 16u);
}

/**
 *******************************************************************************
 ** \brief  Get the Device OUT EP Interrupt register(DOEPINT) not including the 
 **         interrupt bits that are masked.
 ** \param  pdev : device instance
 ** \param  epnum: end point index
 ** \retval all the interrupt bits on DOEPINTn while n = epnum
 ******************************************************************************/
static __INLINE uint32_t hd_usb_getoepintbit(usb_core_instance *pdev , uint8_t epnum)
{
    uint32_t v;
    v  = HD_USB_RDREG32(&pdev->regs.OUTEP_REGS[epnum]->DOEPINT);
    v &= HD_USB_RDREG32(&pdev->regs.DREGS->DOEPMSK);
    return v;
}

/**
 *******************************************************************************
 ** \brief  Get the IN endpoint interrupt bits from the all endpoint interrupt
 **         register not including the bits masked.
 ** \param  pdev : device instance
 ** \retval The status that shows which IN EP have interrupted.
 ******************************************************************************/
static __INLINE uint32_t hd_usb_getalliepintr(usb_core_instance *pdev)
{
    uint32_t v;
    v  = HD_USB_RDREG32(&pdev->regs.DREGS->DAINT);
    v &= HD_USB_RDREG32(&pdev->regs.DREGS->DAINTMSK);
    return (v & 0xfffful);
}

/**
 *******************************************************************************
 ** \brief  Set the device a new address.
 ** \param  pdev: device instance
 ** \param  address: device address which will be set to the corresponding register.
 ** \retval none
 ******************************************************************************/
static __INLINE void hd_usb_devaddrset(usb_core_instance *pdev, uint8_t address)
{
    USB_CORE_DCFG_TypeDef  dcfg;
    dcfg.d32       = 0ul;
    dcfg.b.devaddr = address;
    HD_USB_MDFREG32(&pdev->regs.DREGS->DCFG, 0ul, dcfg.d32);
}

#ifdef USE_HOST_MODE

/**
 *******************************************************************************
 ** \brief  Read the register HPRT and reset the following bits. 
 ** \param  pdev : device instance
 ** \retval value of HPRT
 ******************************************************************************/
static __INLINE uint32_t hd_usb_rdhprt(usb_core_instance *pdev)
{
    USB_CORE_HPRT_TypeDef  tmp_hprt;

    tmp_hprt.d32              = HD_USB_RDREG32(pdev->regs.HPRT0);
    tmp_hprt.b.prtena         = 0u;
    tmp_hprt.b.prtconndet     = 0u;
    tmp_hprt.b.prtenchng      = 0u;
    tmp_hprt.b.prtovrcurrchng = 0u;
    return tmp_hprt.d32;
}

/**
 *******************************************************************************
 ** \brief  Issues a ping token
 ** \param  pdev : device instance
 ** \param  hc_num: the host channel index
 ** \retval none
 ******************************************************************************/
static __INLINE void hd_usb_pingtokenissue(usb_core_instance *pdev , uint8_t hc_num)
{
    USB_CORE_HCCHAR_TypeDef    tmp_hcchar;
    USB_CORE_HCTSIZn_TypeDef   tmp_hctsiz;

    tmp_hctsiz.d32      = 0ul;
    tmp_hctsiz.b.dopng  = 1u;
    tmp_hctsiz.b.pktcnt = 1u;
    HD_USB_WRREG32(&pdev->regs.HC_REGS[hc_num]->HCTSIZ, tmp_hctsiz.d32);

    tmp_hcchar.d32      = HD_USB_RDREG32(&pdev->regs.HC_REGS[hc_num]->HCCHAR);
    tmp_hcchar.b.chen   = 1u;
    tmp_hcchar.b.chdis  = 0u;
    HD_USB_WRREG32(&pdev->regs.HC_REGS[hc_num]->HCCHAR, tmp_hcchar.d32);
}

/**
 ** \brief  This function returns the frame number for sof packet
 ** \param  pdev : device instance
 ** \retval Frame number
 ******************************************************************************/
static __INLINE uint8_t hd_usb_ifevenframe (usb_core_instance *pdev)
{
    return !(HD_USB_RDREG32(&pdev->regs.HREGS->HFNUM) & 0x1u);
}

/**
 *******************************************************************************
 ** \brief  Initializes the FSLSPClkSel field of the HCFG register on the PHY type
 ** \param  pdev : device instance
 ** \param  freq : clock frequency
 ** \retval none
 ******************************************************************************/
static __INLINE void hd_usb_fslspclkselset(usb_core_instance *pdev , uint8_t freq)
{
    USB_CORE_HCFG_TypeDef   tmp_hcfg;

    tmp_hcfg.d32           = HD_USB_RDREG32(&pdev->regs.HREGS->HCFG);
    tmp_hcfg.b.fslspclksel = freq;
    HD_USB_WRREG32(&pdev->regs.HREGS->HCFG, tmp_hcfg.d32);
}

/**
 *******************************************************************************
 ** \brief  suspend the port
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
static __INLINE void hd_usb_prtsusp(usb_core_instance *pdev)
{
    USB_CORE_HPRT_TypeDef     port0;

    port0.d32       = hd_usb_rdhprt(pdev);
    port0.b.prtsusp = 1u;
    port0.b.prtres  = 0u;
    HD_USB_WRREG32(pdev->regs.HPRT0, port0.d32);
}

/**
 *******************************************************************************
 ** \brief  control the enumeration speed of the core, this function make sure that
 **         the maximum speed supperted by the connected device.
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
static __INLINE void hd_usb_enumspeed(usb_core_instance *pdev)
{
    USB_CORE_HCFG_TypeDef  tmp_hcfg;
    tmp_hcfg.d32        = HD_USB_RDREG32(&pdev->regs.HREGS->HCFG);
    tmp_hcfg.b.fslssupp = 0u;
    HD_USB_WRREG32(&pdev->regs.HREGS->HCFG, tmp_hcfg.d32);    
}

/**
 *******************************************************************************
 ** \brief  set the TXFIFO and depth for non-periodic and periodic and RXFIFO size
 ** \param  pdev : device instance
 ** \retval none
 ******************************************************************************/
static __INLINE void hd_usb_sethostfifo(usb_core_instance *pdev)
{
    USB_CORE_FSIZ_TypeDef            nptxfifosize;
    USB_CORE_FSIZ_TypeDef            ptxfifosize;
    nptxfifosize.d32 = 0ul;
    ptxfifosize.d32  = 0ul;

#ifdef USB_FS_MODE      /* USBFS Core*/
    HD_USB_WRREG32(&pdev->regs.GREGS->GRXFSIZ, (uint32_t)RX_FIFO_FS_SIZE);   //set the RxFIFO Depth
    nptxfifosize.b.startaddr = RX_FIFO_FS_SIZE;                              //non-periodic transmit RAM start address
    nptxfifosize.b.depth     = TXH_NP_FS_FIFOSIZ;                                //set the non-periodic TxFIFO depth
    HD_USB_WRREG32(&pdev->regs.GREGS->GNPTXFSIZ, nptxfifosize.d32);          //set the register-GNPTXFSIZ
    ptxfifosize.b.startaddr  = RX_FIFO_FS_SIZE + TXH_NP_FS_FIFOSIZ;           //set the host periodic TxFIFO start address
    ptxfifosize.b.depth      = TXH_P_FS_FIFOSIZ;                              //set the host periodic TxFIFO depth
    HD_USB_WRREG32(&pdev->regs.GREGS->HPTXFSIZ, ptxfifosize.d32);    
#else
    /* set Rx FIFO size */
    HD_USB_WRREG32(&pdev->regs.GREGS->GRXFSIZ, RX_FIFO_HS_SIZE);
    nptxfifosize.b.startaddr = RX_FIFO_HS_SIZE;
    nptxfifosize.b.depth = TXH_NP_HS_FIFOSIZ;
    HD_USB_WRREG32(&pdev->regs.GREGS->GNPTXFSIZ, nptxfifosize.d32);

