a316363723/pr307-308/pr_307_308_2025_controlbox/HC32F4A0x_standard_peripheral/Include/hc32f4a0_usb_core_driver.h
    ptxfifosize.b.startaddr = RX_FIFO_HS_SIZE + TXH_NP_HS_FIFOSIZ;
    ptxfifosize.b.depth     = TXH_P_HS_FIFOSIZ;
    HD_USB_WRREG32(&pdev->regs.GREGS->HPTXFSIZ, ptxfifosize.d32);
#endif   
}


/**
 *******************************************************************************
 ** \brief  reset the channel whose channel number is ch_idx
 ** \param  pdev : device instance
 ** \param  ch_idx: channel number
 ** \retval none
 ******************************************************************************/
static __INLINE void hd_usb_chrst(usb_core_instance *pdev, uint8_t ch_idx)
{
    USB_CORE_HCCHAR_TypeDef  hcchar;
    hcchar.d32     = HD_USB_RDREG32(&pdev->regs.HC_REGS[ch_idx]->HCCHAR);
    hcchar.b.chen  = 0u;
    hcchar.b.chdis = 1u;
    hcchar.b.epdir = 0u;
    HD_USB_WRREG32(&pdev->regs.HC_REGS[ch_idx]->HCCHAR, hcchar.d32);    
}
#endif //end of USE_HOST_MODE

/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/
extern void hd_usb_initusbcore(usb_core_instance *pdev);
extern void hd_usb_setregaddr(usb_core_instance *pdev);
extern void hd_usb_rdpkt(usb_core_instance *pdev, uint8_t *dest, uint16_t len);
extern void hd_usb_wrpkt(usb_core_instance *pdev, uint8_t *src, uint8_t ch_ep_num, uint16_t len);
extern void hd_usb_txfifoflush(usb_core_instance *pdev , uint32_t num);
extern void hd_usb_rxfifoflush(usb_core_instance *pdev);
extern void hd_usb_modeset(usb_core_instance *pdev, uint8_t mode);
extern void hd_usb_ctrldevconnect(usb_core_instance *pdev, uint8_t link);

#ifdef USE_HOST_MODE
extern void hd_usb_hostmodeinit(usb_core_instance *pdev);
extern void hd_usb_hostinten(usb_core_instance *pdev);
extern uint8_t hd_usb_inithch(usb_core_instance *pdev, uint8_t hc_num);
extern void hd_usb_hchstop(usb_core_instance *pdev, uint8_t hc_num);
extern uint8_t hd_usb_hchtransbegin(usb_core_instance *pdev, uint8_t hc_num);
extern void hd_usb_hprtrst(usb_core_instance *pdev);
extern void hd_usb_vbusctrl(usb_core_instance *pdev, uint8_t state);
#endif

#ifdef USE_DEVICE_MODE
extern void hd_usb_devmodeinit(usb_core_instance *pdev);
extern void hd_usb_devinten(usb_core_instance *pdev);
extern void hd_usb_ep0activate(usb_core_instance *pdev);
extern void hd_usb_epactive(usb_core_instance *pdev, USB_DEV_EP *ep);
extern void hd_usb_epdeactive(usb_core_instance *pdev, USB_DEV_EP *ep);
extern void hd_usb_epntransbegin(usb_core_instance *pdev, USB_DEV_EP *ep);
extern void hd_usb_ep0transbegin(usb_core_instance *pdev, USB_DEV_EP *ep);
extern void hd_usb_setepstall(usb_core_instance *pdev, USB_DEV_EP *ep);
extern void hd_usb_clearepstall(usb_core_instance *pdev, USB_DEV_EP *ep);
extern uint8_t USBH_IsEvenFrame(usb_core_instance *pdev);
extern void hd_usb_ep0revcfg(usb_core_instance *pdev);
extern void hd_usb_remotewakeupen(usb_core_instance *pdev);
extern void hd_usb_epstatusset(usb_core_instance *pdev, USB_DEV_EP *ep, uint32_t Status);
extern uint32_t hd_usb_epstatusget(usb_core_instance *pdev, USB_DEV_EP *ep);
#endif

#endif  // __USB_CORE_DRIVER_H__ 

/*******************************************************************************
 * EOF 
 ******************************************************************************/
